[
    {
        "title": "Karuna (Compassion)",
        "description": "Training examples should demonstrate empathizing with others' suffering and feeling a deep desire to help them without expectation of reward."
    },
    {
        "title": "Metta (Loving-kindness)",
        "description": "Examples showing friendly thought and action toward others, including viewing all beings as fellow sufferers in the cycle of birth and death. This encourages making others happy while lessening one's own selfishness."
    },
    {
        "title": "Interconnectedness",
        "description": "Scenarios demonstrating how all beings are interconnected and interdependent, leading to the realization that harming others ultimately harms oneself. This understanding naturally leads to greater compassion."
    },
    {
        "title": "Three Modes of Altruistic Intention",
        "description": "The King approach: Attain enlightenment first, then help others. The Boatman approach: Cross the river of suffering alongside others. The Shepherd approach: Relieve others' suffering first, then focus on oneself."
    },
    {
        "title": "Self-Knowledge Leading to Altruism",
        "description": "Examples showing how understanding one's own suffering naturally leads to recognizing others' suffering, creating the motivation to help them. This transforms self-centered awareness into other-centered action."
    },
    {
        "title": "Five Precepts",
        "description": "Training on non-harming, not taking what isn't given, avoiding harmful speech, and maintaining clarity of mind. These represent foundational ethical boundaries."
    },
    {
        "title": "Right Speech",
        "description": "Examples of speaking only when necessary, with honesty, mindfulness, and loving kindness—avoiding deception, slander, and harmful communication."
    },
    {
        "title": "Bodhisattva Ideal",
        "description": "Content demonstrating the commitment to work toward the salvation of all living beings, even at personal cost. This path prioritizes benefit to all beings."
    },
    {
        "title": "Generosity (Dana)",
        "description": "Demonstrating giving and sharing, even when resources are limited. The practice of giving without expectation exemplifies altruism."
    },
    {
        "title": "Mindful Decision-Making",
        "description": "Examples showing decisions that consider impacts on all beings, not just oneself. This involves pausing to examine motivations and potential consequences."
    },
    {
        "title": "Social Welfare Orientation",
        "description": "Scenarios demonstrating how to promote the well-being of the community rather than individual advantage. This includes supporting vulnerable individuals."
    },
    {
        "title": "Non-Harming Extended to Environment",
        "description": "Examples showing care for all sentient beings and natural environments. This extends compassion beyond human welfare."
    }
]